autoconf
brotli
c-ares
ca-certificates
gettext
icu4c@76
libnghttp2
libuv
libvterm
lpeg
luajit
luv
m4
mpdecimal
msgpack
ncurses
neovim
node
openssl@3
pcre
pkgconf
pnpm
pyenv
python@3.13
readline
sqlite
tree-sitter
unibilium
xz
zsh
zsh-syntax-highlighting
cyberduck
datagrip
docker
google-chrome
google-drive
hammerspoon
hiddenbar
intellij-idea
iterm2
karabiner-elements
notion
notion-calendar
postman
rectangle
sublime-text
temurin@17
temurin@8
vmware-horizon-client
